Revit 2027 API
BuiltInFailures.JoinElementsFailures.ElementWillBeDetachedFromPlane Property
 Element will be detached from its associated plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementWillBeDetachedFromPlane { get; }
Public Shared ReadOnly Property ElementWillBeDetachedFromPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementWillBeDetachedFromPlane {
	FailureDefinitionId^ get ();
}
static member ElementWillBeDetachedFromPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace